# BottomSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptBlend..::..BottomSketch Property
SweptBlend Class See Also
---
The bottom profile sketch of the swept blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Sketch BottomSketch { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BottomSketch As Sketch
	Get
```

Visual C++
---
```text
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
```

# Remarks
If the bottom profile is based on a family symbol, this property is nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
SweptBlend Class
Autodesk.Revit.DB Namespace